Catalogs/КлассификаторПрограммОбученияПоОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КлассификаторПрограммОбученияПоОхранеТруда</Name>
			<Comment>АПК:58</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКлассификатораМинтруда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КлассификаторПрограммОбученияПоОхранеТруда/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Возвращает реквизиты справочника, которые образуют естественный ключ для элементов справочника.
//
// Возвращаемое значение:
//  Массив из Строка - имена реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("КодКлассификатораМинтруда");
	
	Возврат Результат;
	
КонецФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("НачальноеЗаполнение");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("КодКлассификатораМинтруда");
	Поля.Добавить("ПолноеНаименование");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон("%1. %2", Данные.КодКлассификатораМинтруда, Данные.ПолноеНаименование);
	
КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	ДанныеВыбора = Новый СписокЗначений;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Классификатор.Ссылка КАК Ссылка,
		|	Классификатор.КодКлассификатораМинтруда КАК КодКлассификатораМинтруда,
		|	Классификатор.Код КАК Код,
		|	Классификатор.ПолноеНаименование КАК ПолноеНаименование,
		|	ИСТИНА КАК НайденПоКодуКлассификатораМинтруда,
		|	ЛОЖЬ КАК НайденПоКоду
		|ПОМЕСТИТЬ ВТОтобранныеЭлементы
		|ИЗ
		|	Справочник.КлассификаторПрограммОбученияПоОхранеТруда КАК Классификатор
		|ГДЕ
		|	&УсловиеПоКодКлассификатораМинтруда
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Классификатор.Ссылка,
		|	Классификатор.КодКлассификатораМинтруда,
		|	Классификатор.Код,
		|	Классификатор.ПолноеНаименование,
		|	ЛОЖЬ,
		|	ИСТИНА
		|ИЗ
		|	Справочник.КлассификаторПрограммОбученияПоОхранеТруда КАК Классификатор
		|ГДЕ
		|	&УсловиеПоКод
		|	И Классификатор.Код <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Классификатор.Ссылка,
		|	Классификатор.КодКлассификатораМинтруда,
		|	Классификатор.Код,
		|	Классификатор.ПолноеНаименование,
		|	ЛОЖЬ,
		|	ЛОЖЬ
		|ИЗ
		|	Справочник.КлассификаторПрограммОбученияПоОхранеТруда КАК Классификатор
		|ГДЕ
		|	&УсловиеПоПолноеНаименование
		|	И Классификатор.ПолноеНаименование <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтобранныеЭлементы.Ссылка КАК Ссылка,
		|	ОтобранныеЭлементы.КодКлассификатораМинтруда КАК КодКлассификатораМинтруда,
		|	ОтобранныеЭлементы.Код КАК Код,
		|	ОтобранныеЭлементы.ПолноеНаименование КАК ПолноеНаименование,
		|	МАКСИМУМ(ОтобранныеЭлементы.НайденПоКодуКлассификатораМинтруда) КАК НайденПоКодуКлассификатораМинтруда,
		|	МАКСИМУМ(ОтобранныеЭлементы.НайденПоКоду) КАК НайденПоКоду
		|ИЗ
		|	ВТОтобранныеЭлементы КАК ОтобранныеЭлементы
		|СГРУППИРОВАТЬ ПО
		|	ОтобранныеЭлементы.Ссылка,
		|	ОтобранныеЭлементы.КодКлассификатораМинтруда,
		|	ОтобранныеЭлементы.Код,
		|	ОтобранныеЭлементы.ПолноеНаименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	КодКлассификатораМинтруда,
		|	Код,
		|	ПолноеНаименование";
	
	ДанныеВыбораБЗК.УстановитьОтборыВЗапросеПоПараметрам(
		Запрос, Параметры, "КодКлассификатораМинтруда,Код,ПолноеНаименование", Ложь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ДанныеВыбора.НайтиПоЗначению(Выборка.Ссылка) = Неопределено Тогда
			Если Выборка.НайденПоКодуКлассификатораМинтруда Тогда
				Представление = СтрШаблон("%1 (%2)", СокрЛП(Выборка.КодКлассификатораМинтруда), Выборка.ПолноеНаименование);
			ИначеЕсли Выборка.НайденПоКоду Тогда
				Представление = СтрШаблон("%1 (%2 - %3)",
					СокрЛП(Выборка.Код), СокрЛП(Выборка.КодКлассификатораМинтруда), Выборка.ПолноеНаименование);
			Иначе
				Представление = СтрШаблон("%1 (%2)", Выборка.ПолноеНаименование, СокрЛП(Выборка.КодКлассификатораМинтруда));
			КонецЕсли;
			ДанныеВыбора.Добавить(Выборка.Ссылка, Представление);
		КонецЕсли;
	КонецЦикла;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное заполнение классификатора.
Процедура НачальноеЗаполнение() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПрограммыОбучения.Ссылка,
		|	ПрограммыОбучения.КодКлассификатораМинтруда
		|ИЗ
		|	Справочник.КлассификаторПрограммОбученияПоОхранеТруда КАК ПрограммыОбучения";
	
	СуществующиеПрограммы = Запрос.Выполнить().Выгрузить();
	
	МакетКлассификатора = ПолучитьМакет("КлассификаторПрограммОбучения");
	ДанныеКлассификатора = ОбщегоНазначения.ПрочитатьXMLВТаблицу(МакетКлассификатора.ПолучитьТекст()).Данные;
	
	Для Каждого СтрокаКлассификатора Из ДанныеКлассификатора Цикл
		НовыеРеквизиты = Новый Структура("КодКлассификатораМинтруда,Код,ПолноеНаименование");
		НовыеРеквизиты.КодКлассификатораМинтруда = СокрЛП(СтрокаКлассификатора.Id);
		НовыеРеквизиты.Код = СокрЛП(СтрокаКлассификатора.Code);
		НовыеРеквизиты.ПолноеНаименование = СокрЛП(СтрокаКлассификатора.Title);
		
		Отбор = Новый Структура("КодКлассификатораМинтруда", НовыеРеквизиты.КодКлассификатораМинтруда);
		НайденныеПрограммы = СуществующиеПрограммы.НайтиСтроки(Отбор);
		Если НайденныеПрограммы.Количество() > 0 Тогда
			ПрограммаОбучения = НайденныеПрограммы[0].Ссылка.ПолучитьОбъект();
		Иначе
			ПрограммаОбучения = СоздатьЭлемент();
		КонецЕсли;
		
		НужноЗаписать = Ложь;
		Для Каждого Реквизит Из НовыеРеквизиты Цикл
			Если ПрограммаОбучения[Реквизит.Ключ] = Реквизит.Значение Тогда
				Продолжить;
			КонецЕсли;
			ПрограммаОбучения[Реквизит.Ключ] = Реквизит.Значение;
			НужноЗаписать = Истина;
		КонецЦикла;
		
		Если НужноЗаписать Тогда
			ПрограммаОбучения.ДополнительныеСвойства.Вставить("ПодборИзКлассификатора");
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ПрограммаОбучения);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
